{
  "creator": "Tanya Singh",
  "title": "Compassion with Integrity: Seeing the Best in Ourselves & Others Without Losing Sight of the Truth",
  "link": "https://medium.com/@tsingh_3014/compassion-with-integrity-seeing-the-best-in-ourselves-others-without-losing-sight-of-the-truth-25c6f63917f9?source=rss-9790e98c6117------2",
  "pubDate": "Wed, 30 Apr 2025 13:53:26 GMT",
  "content:encoded": "<p>In life, we are often taught the importance of compassion: to be kind, to forgive, to see the good in others. Yet in practice, compassion is often misunderstood (McEwan &amp; Minou, 2022). Compassion is sometimes associated with pity or weakness. Validation is mistaken for endorsement. And “seeing the best in someone” becomes confused with turning a blind eye to the harm they may cause to themselves or others.</p><p>Real compassion is not passive. It does not require abandoning truth, integrity, or accountability. In fact, true compassion, what we might call <em>compassion with integrity</em>, demands that we see clearly, speak honestly, and stay engaged even when what we see is difficult. It reframes compassion not as passive acceptance or confrontation, but as the ongoing practice of holding both care and integrity at once.</p><ul><li>It is the belief that you are more than the worst things you have done.</li><li>It is the refusal to shame, but also the refusal to collude.</li><li>It is a commitment to your highest self, and to mine.</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*lgNtphFh44fAT6xDcIs10g.png\" /></figure><p><strong>What It Means to Truly See the Best in Someone</strong></p><p>To see the best in someone is not to always assume good intentions. Nor is it to minimize the reality of harmful behaviors. Rather, it is to look at the whole person — their actions, their struggles, their defenses — and still hold faith in their capacity for growth. It is to say:</p><blockquote>“I see what you are doing. I see the harm this may be causing. And I believe you are capable of choosing differently.”</blockquote><p>This stance is not about comfort. It requires emotional steadiness and the willingness to remain present when things feel unclear or difficult. <em>To truly see someone involves staying curious, asking honest questions, and being open to what those answers might reveal</em>. Reflection in this context is not judgment, but a form of care that respects the other’s potential for integrity.</p><p>Seeing the best in someone does not mean shielding them from the discomfort of truth. <em>It means believing they are strong enough to face it, and worthy enough to be met with respect while doing so</em>.</p><p>The kind of truth this work speaks to is not a snap judgment or a passing feeling. It is not, “I had a weird reaction to someone, so that must be the truth about them,” nor is it a license to moralize or label others based on discomfort. This truth is something that is earned through process, discernment, humility, and time. It emerges from a willingness to stay engaged: to keep asking questions, to examine your own reactions, and to be open to what unfolds. Often, clarity reveals itself through patterns and presence, not through certainty or quick conclusions.</p><p>Sometimes the truth we are trying to name is not a shared understanding, but a pattern we have come to recognize over time, one that has caused harm even if it is denied. Not all truths need to be agreed upon to be valid. <em>Clarity often arises not from mutual understanding, but from self-honesty</em>.</p><p><strong>The Danger of Two Extremes: Collusion or Shame</strong></p><p>Without this balance, we risk falling into two common traps:</p><ul><li>Collusion: Over-validating or avoiding difficult truths to preserve comfort, which ultimately enables harmful patterns to continue unchecked.</li><li>Shaming: Confronting behavior in a way that leaves the person feeling defective, hopeless, or unworthy of change.</li></ul><p>Neither serves growth. Compassion with integrity lives in the space between, calling in rather than calling out. <em>It means holding people to their highest selves, not from moral superiority, but from belief in their capacity to meet that standard</em>.</p><p><strong>Why Compassion with Integrity Begins Within Ourselves</strong></p><p>This way of relating is not just something we offer to others. It is the work we must do within ourselves.</p><p>At the core of much psychological suffering is the difficulty of facing ourselves with honesty and care at the same time. The belief that we are only worthy when we get it right, or only deserving of kindness when we meet certain conditions, often keeps people stuck. Much of healing involves loosening the grip of self-judgment enough to feel what we feel, reflect honestly, and begin to grow.</p><p>But this kind of compassion cannot be authentically offered to others unless it is also practiced internally. The relationship we have with ourselves shapes the way we move through the world.</p><p>Self-compassion with integrity asks:</p><blockquote>“Where did I fall short of my values? Can I acknowledge that honestly, repair where possible, and stay committed to doing better — without weaponizing shame against myself?<em>”</em></blockquote><p>Mistakes will happen. What matters is how we meet them — not with cruelty or collapse, but with steadiness. There is immense peace in knowing that you will not abandon yourself.</p><p>This is not the kind of compassion that collapses. It is not soft in the way of excusing, erasing, or indulging. It is soft in the way of staying beside yourself even when you are at your worst. It is a fierce kind of love, the kind that says:</p><blockquote>“I will not let you off the hook of your integrity, but I will never shame you while you struggle to stay on it.”</blockquote><p>This is not indulgence, and it is not denial. It is the compassion that stays, not because it feels good, but because it is true.</p><p>Living this way matters not just because it helps us treat others with more care. It matters because it feels better to live this way. It makes us more whole. It allows us to keep returning to ourselves through the inevitable work of being human.</p><p><strong>When and Where Compassion with Integrity Belongs</strong></p><p>Compassion with integrity belongs most naturally in relationships marked by a shared investment in honesty, care, and growth. It thrives where there is willingness to face discomfort for the sake of something truer and stronger. But it is not appropriate everywhere.</p><p>Some contexts, like professional helping roles, demand it. Other relationships, like close friendships or partnerships grounded in mutual trust, may also call for it. Yet there are situations where offering this level of reflection is neither safe nor welcomed, and discernment matters.</p><p><strong>Compassion with Integrity in Therapy</strong></p><p>In therapy, this stance is not optional. It is an ethical responsibility.</p><p>Therapeutic work is not simply about soothing or validating. Nor is it about confrontation for its own sake. It is about creating the conditions where growth, healing, and change become possible. That requires honesty alongside care.</p><p>Validation without truth-telling risks colluding with the very patterns that keep people stuck. Confrontation without compassion breeds shame and defensiveness, making change harder rather than easier.</p><p>Compassion with integrity allows for another way. It enables the therapist to say:</p><blockquote><em>“</em>I know this is hard to look at. But let us be honest together about what is happening here.<em>”</em></blockquote><p>This is not just theoretical. The therapist’s own stance shapes the emotional tone and safety of the space. How we hold ourselves — including how we handle our own mistakes — becomes part of what we offer.</p><p>This is especially visible when rupture happens, as it inevitably will. Repair is not failure; it is part of the work. The willingness to take responsibility and name our own missteps models something essential:</p><blockquote>“I realize I reacted from a place of frustration last time. That was not my best work, and I am sorry. I will do my best to show up differently.”</blockquote><p>These are not just words; they are a living example of what compassion with integrity looks like in action. When followed by consistent effort, they show that it is possible to reflect on your own behavior, to stay connected to your values without collapsing into shame, and to recommit to doing better. This models a way of being that many clients are learning to believe is possible: one where accountability and care can live side by side, without fear or punishment.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*wkkKZRd87tj4g1x-GgcF0g.jpeg\" /></figure><p><strong>Compassion with Integrity in Other Relationships</strong></p><p>In close mutual relationships, such as deep friendships, partnerships, and intimate connections, compassion with integrity can be transformative. <em>When honesty, care, and growth are welcomed by both people, this way of relating becomes not only possible but life-giving</em>. It allows relationships to thrive through a shared commitment to seeing each other clearly, honoring each other’s struggles, and holding each other accountable with care rather than cruelty.</p><p>In these spaces, telling the truth becomes an act of love, not a weapon. Seeing the best in one another, while also seeing clearly where growth is possible, builds a kind of trust that is rare and deeply nourishing. Mutual understanding may not always be immediately reachable, but the process of striving for it — of staying curious and present — strengthens the bond rather than eroding it.</p><p>However, not every relationship is built for this. And not every relationship needs to be.</p><p>Sometimes the most compassionate choice is to let people be where they are, without trying to intervene, correct, or call out. Seeing clearly does not always mean speaking. Discernment is essential.</p><p>In many relationships, truth-telling may not be welcomed or appropriate. But staying honest with ourselves about what we see, even when we choose not to engage directly, protects our integrity. <em>It allows us to decide, from clarity rather than illusion, what kind of connection we are willing to participate in</em>.</p><p><strong>Acting from Integrity, Not Outcome</strong></p><p>Even when we bring care and integrity to the work, there is no guarantee of how we will be received. The other person may not be ready. The relationship may rupture anyway. Change may not come.</p><p>Without awareness, this stance can quietly become another way of trying to control:</p><blockquote>“If I show up well enough, they will hear me. If I do this right, they will change.”</blockquote><p><em>But control is not care. Integrity is not a strategy.</em></p><p>This work asks that we tell the truth because truth matters, not because we are trying to engineer a particular result. It asks that we care because care is who we have chosen to be, not because it will guarantee the outcome we hope for.</p><p>Buddhist teachings remind us that much of our suffering comes not from pain itself, but from clinging, from grasping at how we wish things would be (Hanh, 1999). <em>Letting go of that clinging while staying true to ourselves is often the hardest and most courageous work we can do</em>. It asks for a kind of surrender that is not passive but deeply rooted in self-trust, and though it is not easy, it frees us to act with honesty rather than fear. It requires a strength and tenderness that can only be cultivated over time.</p><p>In this way, letting go of outcomes does not become about abandoning action or care. It means that our actions are no longer fueled by grasping. Instead, they arise from who we are.</p><p>The Daoist principle of wu wei, or non-forcing, effortless action, also reflects this truth. <em>When we act from alignment rather than fear, our choices do not need to be forced</em>. They unfold naturally, like a river following its course, shaped by integrity rather than by clinging or control (Lao Tzu, trans. Mitchell, 1988).</p><p><strong>Conclusion: Compassion with Integrity as an Act of Respect</strong></p><p>Compassion with integrity is not about getting it right every time. It is about the willingness to stay in relationship with the truth, even when the truth is messy, incomplete, or hard to hold.</p><p>It is about offering both yourself and others the gift of accountability without shame, honesty without cruelty, and care without collusion.</p><p>It asks that we hold ourselves to the same standards we hope for in others, not perfectly, but sincerely.</p><p>And perhaps this, too, is what it means to respect the unfolding of life: to meet each moment with as much integrity as we can, and to know when it is time to soften, let go, and trust that what was meant to happen has happened.</p><p>In the end, living with compassion and integrity is not a strategy for life. It is a way of honoring the life we are already given.</p><p><strong>References</strong></p><ul><li>Hanh, T. N. (1999). Hanh, T. N. (1999). The heart of the Buddha’s teaching: Transforming suffering into peace, joy &amp; liberation: The four noble truths, the noble eightfold path, and other basic Buddhist teachings. Broadway Books.</li><li>Lao Tzu. (1988). Tao Te Ching (S. Mitchell, Trans.). Harper Perennial.</li><li>McEwan, K., &amp; Minou, L. (2023). Defining compassion: A Delphi study of compassion therapists’ experiences when introducing patients to the term ‘compassion’. <em>Psychology and Psychotherapy: Theory, Research and Practice</em>, <em>96</em>(1), 16–24.</li></ul><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=25c6f63917f9\" width=\"1\" height=\"1\" alt=\"\">",
  "content:encodedSnippet": "In life, we are often taught the importance of compassion: to be kind, to forgive, to see the good in others. Yet in practice, compassion is often misunderstood (McEwan & Minou, 2022). Compassion is sometimes associated with pity or weakness. Validation is mistaken for endorsement. And “seeing the best in someone” becomes confused with turning a blind eye to the harm they may cause to themselves or others.\nReal compassion is not passive. It does not require abandoning truth, integrity, or accountability. In fact, true compassion, what we might call compassion with integrity, demands that we see clearly, speak honestly, and stay engaged even when what we see is difficult. It reframes compassion not as passive acceptance or confrontation, but as the ongoing practice of holding both care and integrity at once.\n\nIt is the belief that you are more than the worst things you have done.\nIt is the refusal to shame, but also the refusal to collude.\nIt is a commitment to your highest self, and to mine.\n\nWhat It Means to Truly See the Best in Someone\nTo see the best in someone is not to always assume good intentions. Nor is it to minimize the reality of harmful behaviors. Rather, it is to look at the whole person — their actions, their struggles, their defenses — and still hold faith in their capacity for growth. It is to say:\n“I see what you are doing. I see the harm this may be causing. And I believe you are capable of choosing differently.”\nThis stance is not about comfort. It requires emotional steadiness and the willingness to remain present when things feel unclear or difficult. To truly see someone involves staying curious, asking honest questions, and being open to what those answers might reveal. Reflection in this context is not judgment, but a form of care that respects the other’s potential for integrity.\nSeeing the best in someone does not mean shielding them from the discomfort of truth. It means believing they are strong enough to face it, and worthy enough to be met with respect while doing so.\nThe kind of truth this work speaks to is not a snap judgment or a passing feeling. It is not, “I had a weird reaction to someone, so that must be the truth about them,” nor is it a license to moralize or label others based on discomfort. This truth is something that is earned through process, discernment, humility, and time. It emerges from a willingness to stay engaged: to keep asking questions, to examine your own reactions, and to be open to what unfolds. Often, clarity reveals itself through patterns and presence, not through certainty or quick conclusions.\nSometimes the truth we are trying to name is not a shared understanding, but a pattern we have come to recognize over time, one that has caused harm even if it is denied. Not all truths need to be agreed upon to be valid. Clarity often arises not from mutual understanding, but from self-honesty.\nThe Danger of Two Extremes: Collusion or Shame\nWithout this balance, we risk falling into two common traps:\n\nCollusion: Over-validating or avoiding difficult truths to preserve comfort, which ultimately enables harmful patterns to continue unchecked.\nShaming: Confronting behavior in a way that leaves the person feeling defective, hopeless, or unworthy of change.\n\nNeither serves growth. Compassion with integrity lives in the space between, calling in rather than calling out. It means holding people to their highest selves, not from moral superiority, but from belief in their capacity to meet that standard.\nWhy Compassion with Integrity Begins Within Ourselves\nThis way of relating is not just something we offer to others. It is the work we must do within ourselves.\nAt the core of much psychological suffering is the difficulty of facing ourselves with honesty and care at the same time. The belief that we are only worthy when we get it right, or only deserving of kindness when we meet certain conditions, often keeps people stuck. Much of healing involves loosening the grip of self-judgment enough to feel what we feel, reflect honestly, and begin to grow.\nBut this kind of compassion cannot be authentically offered to others unless it is also practiced internally. The relationship we have with ourselves shapes the way we move through the world.\nSelf-compassion with integrity asks:\n“Where did I fall short of my values? Can I acknowledge that honestly, repair where possible, and stay committed to doing better — without weaponizing shame against myself?”\nMistakes will happen. What matters is how we meet them — not with cruelty or collapse, but with steadiness. There is immense peace in knowing that you will not abandon yourself.\nThis is not the kind of compassion that collapses. It is not soft in the way of excusing, erasing, or indulging. It is soft in the way of staying beside yourself even when you are at your worst. It is a fierce kind of love, the kind that says:\n“I will not let you off the hook of your integrity, but I will never shame you while you struggle to stay on it.”\nThis is not indulgence, and it is not denial. It is the compassion that stays, not because it feels good, but because it is true.\nLiving this way matters not just because it helps us treat others with more care. It matters because it feels better to live this way. It makes us more whole. It allows us to keep returning to ourselves through the inevitable work of being human.\nWhen and Where Compassion with Integrity Belongs\nCompassion with integrity belongs most naturally in relationships marked by a shared investment in honesty, care, and growth. It thrives where there is willingness to face discomfort for the sake of something truer and stronger. But it is not appropriate everywhere.\nSome contexts, like professional helping roles, demand it. Other relationships, like close friendships or partnerships grounded in mutual trust, may also call for it. Yet there are situations where offering this level of reflection is neither safe nor welcomed, and discernment matters.\nCompassion with Integrity in Therapy\nIn therapy, this stance is not optional. It is an ethical responsibility.\nTherapeutic work is not simply about soothing or validating. Nor is it about confrontation for its own sake. It is about creating the conditions where growth, healing, and change become possible. That requires honesty alongside care.\nValidation without truth-telling risks colluding with the very patterns that keep people stuck. Confrontation without compassion breeds shame and defensiveness, making change harder rather than easier.\nCompassion with integrity allows for another way. It enables the therapist to say:\n“I know this is hard to look at. But let us be honest together about what is happening here.”\nThis is not just theoretical. The therapist’s own stance shapes the emotional tone and safety of the space. How we hold ourselves — including how we handle our own mistakes — becomes part of what we offer.\nThis is especially visible when rupture happens, as it inevitably will. Repair is not failure; it is part of the work. The willingness to take responsibility and name our own missteps models something essential:\n“I realize I reacted from a place of frustration last time. That was not my best work, and I am sorry. I will do my best to show up differently.”\nThese are not just words; they are a living example of what compassion with integrity looks like in action. When followed by consistent effort, they show that it is possible to reflect on your own behavior, to stay connected to your values without collapsing into shame, and to recommit to doing better. This models a way of being that many clients are learning to believe is possible: one where accountability and care can live side by side, without fear or punishment.\n\nCompassion with Integrity in Other Relationships\nIn close mutual relationships, such as deep friendships, partnerships, and intimate connections, compassion with integrity can be transformative. When honesty, care, and growth are welcomed by both people, this way of relating becomes not only possible but life-giving. It allows relationships to thrive through a shared commitment to seeing each other clearly, honoring each other’s struggles, and holding each other accountable with care rather than cruelty.\nIn these spaces, telling the truth becomes an act of love, not a weapon. Seeing the best in one another, while also seeing clearly where growth is possible, builds a kind of trust that is rare and deeply nourishing. Mutual understanding may not always be immediately reachable, but the process of striving for it — of staying curious and present — strengthens the bond rather than eroding it.\nHowever, not every relationship is built for this. And not every relationship needs to be.\nSometimes the most compassionate choice is to let people be where they are, without trying to intervene, correct, or call out. Seeing clearly does not always mean speaking. Discernment is essential.\nIn many relationships, truth-telling may not be welcomed or appropriate. But staying honest with ourselves about what we see, even when we choose not to engage directly, protects our integrity. It allows us to decide, from clarity rather than illusion, what kind of connection we are willing to participate in.\nActing from Integrity, Not Outcome\nEven when we bring care and integrity to the work, there is no guarantee of how we will be received. The other person may not be ready. The relationship may rupture anyway. Change may not come.\nWithout awareness, this stance can quietly become another way of trying to control:\n“If I show up well enough, they will hear me. If I do this right, they will change.”\nBut control is not care. Integrity is not a strategy.\nThis work asks that we tell the truth because truth matters, not because we are trying to engineer a particular result. It asks that we care because care is who we have chosen to be, not because it will guarantee the outcome we hope for.\nBuddhist teachings remind us that much of our suffering comes not from pain itself, but from clinging, from grasping at how we wish things would be (Hanh, 1999). Letting go of that clinging while staying true to ourselves is often the hardest and most courageous work we can do. It asks for a kind of surrender that is not passive but deeply rooted in self-trust, and though it is not easy, it frees us to act with honesty rather than fear. It requires a strength and tenderness that can only be cultivated over time.\nIn this way, letting go of outcomes does not become about abandoning action or care. It means that our actions are no longer fueled by grasping. Instead, they arise from who we are.\nThe Daoist principle of wu wei, or non-forcing, effortless action, also reflects this truth. When we act from alignment rather than fear, our choices do not need to be forced. They unfold naturally, like a river following its course, shaped by integrity rather than by clinging or control (Lao Tzu, trans. Mitchell, 1988).\nConclusion: Compassion with Integrity as an Act of Respect\nCompassion with integrity is not about getting it right every time. It is about the willingness to stay in relationship with the truth, even when the truth is messy, incomplete, or hard to hold.\nIt is about offering both yourself and others the gift of accountability without shame, honesty without cruelty, and care without collusion.\nIt asks that we hold ourselves to the same standards we hope for in others, not perfectly, but sincerely.\nAnd perhaps this, too, is what it means to respect the unfolding of life: to meet each moment with as much integrity as we can, and to know when it is time to soften, let go, and trust that what was meant to happen has happened.\nIn the end, living with compassion and integrity is not a strategy for life. It is a way of honoring the life we are already given.\nReferences\n\nHanh, T. N. (1999). Hanh, T. N. (1999). The heart of the Buddha’s teaching: Transforming suffering into peace, joy & liberation: The four noble truths, the noble eightfold path, and other basic Buddhist teachings. Broadway Books.\nLao Tzu. (1988). Tao Te Ching (S. Mitchell, Trans.). Harper Perennial.\nMcEwan, K., & Minou, L. (2023). Defining compassion: A Delphi study of compassion therapists’ experiences when introducing patients to the term ‘compassion’. Psychology and Psychotherapy: Theory, Research and Practice, 96(1), 16–24.",
  "dc:creator": "Tanya Singh",
  "guid": "https://medium.com/p/25c6f63917f9",
  "categories": [
    "east-meets-west",
    "compassion",
    "healing",
    "self-growth-journey",
    "therapy"
  ],
  "isoDate": "2025-04-30T13:53:26.000Z"
}